mat =[100, 85, 78, 42, 79, 34, 65, 49, 53, 100]
rus =[73, 100, 34, 100, 20, 100, 47, 36, 75, 34]
inf =[65, 73, 15, 100, 100, 85, 23, 15, 49, 75]
stud = ["Егор", "Андрей", "Григорий", "Семен", "Никита", "Филипп", "Стас", "Ярослав", "Николай", "Антон", "Алина"]
kolvo = []
# Проходной балл - 195
for i in range(10):
    for j in range(1):
        obch = mat[i]+rus[i]+inf[i]
        kolvo.append(obch)

            

for i in range(0, 25):
    
    if i <= 9:
        
            
            if kolvo[i] >= 195:
                print(stud[i], "принят")
            else:  
                print(stud[i], "пошел вон")
                i -=1          
    else:
        print("Набор закончен. Остальных просим уйти")
        break
    i +=1