mat =[100, 85, 78, 42, 79, 34, 65, 49, 53, 100, 100]
rus =[73, 100, 34, 100, 20, 100, 47, 36, 75, 34, 100]
inf =[65, 73, 15, 100, 100, 85, 23, 15, 49, 75, 100]
stud = ["Анна  Марковна Титова", "Дамир Ярославович Агапов", "Андрей Артёмович Климов", "Анна Романовна Львова", "Никита Олегович Шарипов", "Филипп Дмитриевич Мальцев", "ДанилА Викторович Зимин", "Иван Иванович Хромцов", "Николай Александрович Романов", "Иосиф Виссарионович Джугашвили", "Владимир Владимирович Ульянов"]
kolvo = []
res = list(zip(stud, mat, rus, inf))
print (res)
